var local_database = [{
    date: "Sep 18 2016",
    title: "水果保鲜小秘密",
    imgSrc: "/images/post/1.jpg",
    content: "香蕉挂在阴凉处，建议买香蕉时，挑选稍生一点的。如果香蕉买来就成熟了，可吊起来放在阴凉处，可以多放几天。2、梨用软纸包 把每个梨用软纸包好，装入纸盒，放入到冰箱内的蔬菜箱……",
    avatar: "/images/avatar/1.jpg",
    reading: "112",
    collection: "86",
    author: "中华美食",
    dateTime: "24小时前",
    detail: "1、香蕉挂在阴凉处，建议买香蕉时，挑选稍生一点的。如果香蕉买来就成熟了，可吊起来放在阴凉处，可以多放几天。2、梨用软纸包 把每个梨用软纸包好，装入纸盒，放入到冰箱内的蔬菜箱中，一星期后取出来拆掉包装纸，装入塑料袋中，不扎口，再放入冰箱冷藏室上层。温度调到0℃左右，一般可存放两个月。3、橘子泡蒜水  将500克大蒜切片，加水煮开。晾凉后，把橘子放入水中泡几分钟，然后捞出存放，可保鲜3个月。4、猕猴桃低温保鲜  猕猴桃适宜在零下0.5℃-0℃的冰箱内保存，并且不能与苹果、梨一同贮藏。因为苹果和梨都容易释放乙烯，会加速猕猴桃果肉成熟腐烂。5、苹果保存讲究温度和湿度  温度保持在1℃-8℃之间最好。再就是湿度，要想家里的苹果保持新鲜，最好用纸把苹果包上，以利保湿。用塑料袋包苹果易烂，苹果包好后，装进纸盒子里放到避光处，可存十天半个月。",
    headImgSrc: "/images/post/1.jpg",
    postId: 0,
}, {
    date: "Nov 20 2016",
    title: "吃牛肉要注意6点",
    content: "牛肉的注意事项一定要有所了解，生活中我们应该避开牛肉的食用禁忌，这样就能充分发挥出牛肉的营养价值，对我们的健康更加有帮助。那么生活中牛肉的食用禁忌有哪些呢?下面就让我们一起来看看吧!",
    dateTime: "24小时前",
    headImgSrc: "/images/post/2.jpg",
    author: "中华美食",
    imgSrc: "/images/post/2.jpg",
    avatar: "/images/avatar/2.jpg",
    reading: "122",
    collection: "96",
    detail: "一 “李安是一位绝不会重复自己的导演，本片将极富原创性”李安众所瞩目的新片《比利林恩漫长的中场休息》，正式更名《半场无战事》。预告片首次曝光后，被视作是明年奥斯卡种子选手。该片根据同名畅销书改编。原著小说荣获美国国家图书奖。也被BBC评为21世纪最伟大的12本英文小说之一。影片讲述一位19岁德州男孩的比利·林恩入伍参加伊战，在一次交火中他大难不死，意外与战友成为大众的关注焦点，并被塑造成英雄。之后他们返回国内，在橄榄球赛中场休息时授勋。这名战争英雄却面临前所未有的心灵煎熬……李安为什么选中这部电影来拍？因为李安想要挑战前所未有的技术难题：以120帧每秒的速度、4K、3D技术全面结合，来掀起一场电影视觉革命。什么意思？所谓“电影是24格每秒的谎言”，其中的24格，就是帧数。",

    postId: 1,

},
{
    title: "寒冬养生汤粥",
    content: "冬季喝什么能够暖身养生呢，一到冬天，很多人就容易受不了，而外在的取暖措施终究比不上由内而外散发的暖意，这个时候就需要喝一些营养美味又能够暖身的粥了，让什么从里到外暖和起来，那么，冬季养生汤粥作用有哪些呢，下面就为大家介绍一下。",
    imgSrc: "/images/post/3.jpg",
    reading: 102,
    collection: 92,
    date: "Nov 20 2016",
    avatar: "/images/avatar/3.jpg",
    headImgSrc: "/images/post/3.jpg",
    author: "中华美食",
    dateTime: "24小时前",
    detail: "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序:微信小程序不能开发游戏类、直播类功能，小程序每个人关注的上限是20个（还不确定，不过我相信这是真的，这次公布的API里并没有视频组件。微信太大，苹果要有所顾忌，但是微信也要做出相应的让步)微信目前有没有同苹果商谈好，还是个未知数，毕竟会对AppStore有一定的冲击。抛弃了大量的javascript组件后，这个生态体系变得相当的封闭，微信解释肯定是：为了更好的性能提升。那么我们拭目以待。小程序的入口是微信里的三级菜单，就是在“Tab栏发现里的游戏下面加入一个“小程序”。反正，这一栏里的购物和游戏我是从来没点进去过的。以腾讯的尿性，小程序同服务号一样，其关系链及重要功能的开放程度会因“人”而异。对，优质的接口只会开放给腾讯的儿子们（滴滴呀、京东呀）",

    postId: 2,
},
{
    title: "低血糖饮食要均衡",
    content: "虽然如今的生活条件好了，但是依旧有很多的朋友会出现低血糖的现象，而有有朋友称他低血糖时就会喝牛奶，那么低血糖喝牛奶好吗?在日常生活中，低血糖怎么办?低血糖吃什么好?",
    imgSrc: "/images/post/4.jpg",
    reading: 62,
    collection: 92,
    date: "Nov 12 2016",
    headImgSrc: "/images/post/4.jpg",
    author: "中华美食",
    dateTime: "三天前",
    avatar: "/images/avatar/4.jpg",
    detail: "1 引言\n\n在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：有些人套用“经济理论“的知识去解释现实中发生的经济事件，结果发现很多事情讲不通，或者发现”理论告诉我们的“与现实发生的是相反的。也有学生经常跟我说：经济学有什么用？为了说明这个，我经常从两个方面来进行解释，尝试用我个人所擅长的解决问题的视角和他们能够听懂的方法来说明经济学是什么，它的作用边界在哪里：\r\n\n2 ”简笔素描“与”油画肖像“我们给人画肖像画，可以用简笔素描，也可以用油画肖像。油画肖像可以在最大程度上保存了人物的各方面的细节和特点，而简笔素描则忽略了很多细节。尽管简笔素描忽略了人物的许多细节，但我们仍旧能够很容易的认出画中的人物是谁。为什么？因为这种方法保留了人物最显著的特征，以至于我们可以忽略其次要特征而对人物做出判定。\n\n2.1 ”简笔素描“对于绝大多数的非经济学专业大众而言（经济学相关专业硕士学历以上），人们所接触到的经济学都是初级微观经济学。所谓的初级微观经济学，对于经济问题的”画法“就是一种”简笔素描“。比如初级微观经济学教材中广为使用的这种一元一次需求函数：y=bx+a，需求量的唯一变量是产品价格。但仅凭直觉我们就可以断言，现实中影响需求量的因素绝不止价格这一种，因此我们可以认为这个模型对经济问题的描述是失真的。然而但这种失真却是必要的和有意义的，其意义在与它利于揭示价格对于需求的影响，而不在于否定影响需求的其他因素——",

    postId: 3,
},
{
    title: "对肝脏有益的水果",
    content: "肝脏对于人体来说非常重要。现代人因为各种各样的应酬和交际，导致很多人的肝脏都饱受摧残。在日常生活中，如果想要保护肝脏，就要多吃一些对肝脏有益的水果。那么到底肝脏不好吃什么呢?",
    imgSrc: "/images/post/5.jpg",
    reading: 102,
    collection: 26,
    date: "Nov 20 2016",
    detail: "消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品。该产品名为“Dexmo”，它是一款像手套那样戴在手上使用的未来主义外骨骼。它内置大量的元件，能够与VR体验进行交互，可帮助你感觉握在你的双手的虚拟物体。Dexmo据Dexta称，“Dexmo是一款针对你的双手的机械外骨骼。它能够捕捉你的手部运动，以及提供即时的力反馈。有了Dexmo，你可以感受到虚拟物体的大小、形状和坚硬度。你可以接触数字世界。”市面上已经有数款产品旨在处理虚拟现实中的手部交互，也有相关的产品即将要进入市场。例如，颇受欢迎的HTC Vive头盔配有一副控制器，其控制器能够使得追踪系统看到你的双手，让你可以用它们来在特定体验中与物体进行交互。今年晚些时候，Oculus将开始出货类似的手部控制产品Oculus Touch。10月，索尼也将开始出货配备两个PlayStation Move手部控制器的PS VR。Leap Motion甚至更进一步：利用传感器来追踪手指和手部的运动。",
    dateTime: "24小时前",
    headImgSrc: "/images/post/5.jpg",
    author: "中华美食",
    avatar: "../../../images/avatar/5.jpg",
    postId: 4,
},

];
var food_post=[{
    name:"西红柿炒蛋",
    image:"/images/food/3.jpg",
    price:"4元"
},
{
    name:"青椒牛肉",
    image:"/images/food/2.jpg",
    price:"3.5元"
},
{
    name:"鸡蛋炒粉",
    image:"/images/food/5.jpg",
    price:"4.5元"
},{
    name:"玉米排骨汤",
    image:"/images/food/1.jpg",
    price:"4元"
},{
    name:"白切鸡",
    image:"/images/food/4.jpg",
    price:"4元"
}];
module.exports = {
    postList: local_database,
    discountList:food_post
}